[
{
"ISTJ":{"general":"They only accept the reality which they are seen and nothing else. They show responsible behavior in all situations. They prefer to follow the traditions and rules. They seem less likely to break the traditions. They are planning for the worst and best. That’s why they enjoy their life.",
        "Features":"Quiet, serious, earn success by thoroughness and dependability. Practical, matter-of-fact, realistic, and responsible.",
        "Special_Feature":"Loyalty",
        "Best_At":"Reaching the Goal or mind stone.",
        "hidden_talent":"Ability to sense danger and crisis in the System.",
        "Can't resist":"Unfinished work. They prefer to finish the jobs.",
        "Hard_to_understand_for_them":"Convention and tradition can be outdated.",
        "Best_gift_for_them":"A new version of their favorite Think.",
        "Professionals":"Dentist, Optometrist, Inspector, lawyer"},
"ISTP":{"general":"They are usually result-oriented people. They prefer the result not how to achieve it. They find it difficult to connect emotionally to the people. They never commit anything. They are enjoying to visit new places and sometimes show their risk-taking behavior.",
        "Features":"Tolerant and flexible, quiet observers until a problem appears, then act quickly to find workable solutions",
        "Special_Feature":"Confidence",
        "Best_At":"A day full of adventures.",
        "hidden_talent":"They are not repulsed by anything except constraints.",
        "Can't resist":"An intense adventure. Like hunting and travelling.",
        "Hard_to_understand_for_them":"Cruel behavior comes back to you.",
        "Best_gift_for_them":"A ticket to travel in the new destination.",
        "Professionals":"The craftsmanship of anything, travel related jobs, Forensic science, Computer sciences"},
"ISFJ":{"general":"They want to maintain balance in all areas of their lives. They understand the emotions of others but find it difficult to show their feels. They prefer the facts over theories. They feel broken but are unable to give up. They see advantage in all situations. Also protective of family traditions.",
        "Features":"Quiet, friendly, responsible, and conscientious. Committed and steady in meeting their obligations. Thorough, painstaking, and accurate. Loyal, considerate.",
        "Special_Feature":"Genuinely kind",
        "Best_At":"Spending quality time with their family..",
        "hidden_talent":"Ability to sense danger and crisis in the people.",
        "Can't resist":"Somebody who needs their help.",
        "Hard_to_understand_for_them":"Sometimes people don’t need help.",
        "Best_gift_for_them":"A room full of people praising them for their helpful work.",
        "Professionals":"Surveillance, Moderators, people and society related jobs."},
"ISFP":{"general":"They are like to do work rather than dreaming about things. They didn’t believe in the theories before seeing the real-world applications. They always want to open their option in all the situation. They seem like freaks to others. They are likely to be bullied, lonely.",
        "Features":"Quiet, friendly, sensitive, and kind. Enjoy the present moment, what's going on around them. Like to have their own space.",
        "Special_Feature":"Sympathetic",
        "Best_At":"Being invested in arts, finding meaning in them.",
        "hidden_talent":"Pain and hardships are their driving force.",
        "Can't resist":"A beautiful thing. Like fashion and beautiful painting.",
        "Hard_to_understand_for_them":"This type needs to learn that cheerfulness will help them in their creativity.",
        "Best_gift_for_them":"An extremely extravagant piece of clothing.",
        "Professionals":"Storytellers, Artists"},
"INFJ":{"general":"They manipulate people very skillfully. They understand people and use them to achieve goals. They have strong sense of intuition and emotional understanding. They also like to control the situation by planning, organizing and making decisions as early as possible.",
        "Features":"Seek meaning and connection in ideas, relationships, and material possessions. INFJ wants to understand what motivates people and are insightful about others.",
        "Special_Feature":"Introspective",
        "Best_At":"Finding meaning in life, feeling like they improved as a person.",
        "hidden_talent":"Ability to change the world.",
        "Can't resist":"The opportunity to teach or lead the situation.",
        "Hard_to_understand_for_them":"You aren’t as skilled at being kind as you think.",
        "Best_gift_for_them":"A notebook filled with people’s kind comments about their personality.",
        "Professionals":"Entrepreneurs"},
"INFP":{"general":"They rely on the intuition and more focus on the big picture rather than a fine details of work. When it comes to decision making, it keeps to open their options. They are most likely to go mad. They wants to get the revenge in all situation even they have to kill themselves.",
        "Features":"Idealistic, loyal to their values and to people who are important to them. Adaptable, flexible, and accepting unless a value is threatened. Curious, Seek to understand people.",
        "Special_Feature":"Moralistic",
        "Best_At":"Have inner peace, feeling love for themselves.",
        "hidden_talent":"Ability to see the core of people.",
        "Can't resist":"A blazing and powerful romance with an unusual person.",
        "Hard_to_understand_for_them":"You are more badass than you think. You need to be able to be confident.",
        "Best_gift_for_them":"A trip with a close person.",
        "Professionals":"Therapists, Counselor, Artist"},
"INTJ":{"general":"They tend to work alone and look at the big picture rather than concrete details. They are more focus on the data and information rather than the emotions of people. They feel secure when controlling the situation and plan in advance. An artfully planned project or endeavor that falls outside of convention circle.",
        "Features":"Have original minds and great drive for implementing their ideas and achieving their goals. Quickly see patterns in external events.",
        "Special_Feature":"Focused",
        "Best_At":"Being alone, learning many things, doing what they find relaxing.",
        "hidden_talent":"Ability to analyses clearly.",
        "Can't resist":"An artfully planned project or endeavor that falls outside of social convention.",
        "Hard_to_understand_for_them":"That some people aren’t always interested in what that have to say.",
        "Best_gift_for_them":"An efficient computer that doubles their typical productivity.",
        "Professionals":"Doctors, Architects, Scientists, Engineers"},
"INTP":{"general":"They are quiet, reserved and thoughtful. They are thinking about theoretical and gives intellect value to them. They will do things that hurt others just because they are interesting in results. They have quality to think out of the box. They are highly objective and logical.",
        "Features":"Seek to develop logical explanations for everything that interests them. Theoretical and abstract, interested more in ideas. Skeptical, sometimes critical, always analytical.",
        "Special_Feature":"Rational, Logical",
        "Best_At":"Spending time on their hobbies without any worries or judgement.",
        "hidden_talent":"Ability to create technological progress.",
        "Can't resist":"New information, like a discovery, or strange new philosophical theory.",
        "Hard_to_understand_for_them":"Nobody cares about you if you continually talking about your strengths.",
        "Best_gift_for_them":"A renovated lab designed for their experiments.",
        "Professionals":"Inventors, Engineers, Writers"},
"ESTP":{"general":"They are looking at a solution immediately rather than planning. They don’t look at theories or concepts but on the practical approach. They are very observant often noticing every detail about people. They are not good planners and taking unnecessary risks.",
        "Features":"Flexible and tolerant, they take a pragmatic approach focused on immediate results. Theories and conceptual explanations bore them - they want to act energetically.",
        "Special_Feature":"Adaptability",
        "Best_At":"An extreme sporty activity.",
        "hidden_talent":"Very adaptable and very endurable.",
        "Can't resist":"A nice risk so called adventure.",
        "Hard_to_understand_for_them":"Eventually, parties aren’t fun, and people start to look at you as a problem.",
        "Best_gift_for_them":"Giving them access to do whatever they want.",
        "Professionals":"Sales related jobs, Paramedic, Entrepreneur"},
"ESTJ":{"general":"They will have a strong high value on traditions, rules, and security. They are usually old school of thought in the life. That why see it as a stubborn and yielding. They have a hard time tolerating other people, despite being extroverts. They tend to be very frank and honest while sharing their opinions.",
        "Features":"Practical, realistic, matter-of-fact. Decisive, quickly move to implement decisions. Organize projects and people to get things done.",
        "Special_Feature":"Down-to-earth",
        "Best_At":"People appreciating their hard work.",
        "hidden_talent":"Ability to nurture systems.",
        "Can't resist":"The opportunity to enforce the rules.",
        "Hard_to_understand_for_them":"You need to be accepting of other people, even if they seem gentler than you.",
        "Best_gift_for_them":"A date with their first crush.",
        "Professionals":"Military, Administrators, Managers"},
"ESFP":{"general":"They are very practical and resourceful. They prefer to do practical work rather than reading the book. They work for the current situation and doesn’t care about long-term results. They wants to be the center of attraction. Often do sometimes strange to come into the spotlight.",
        "Features":"Outgoing, friendly, and accepting. Exuberant lovers of life, people, and material comforts. Enjoy working with others to make things happen.",
        "Special_Feature":"Cheerful",
        "Best_At":"Spending time with the love of their lives.",
        "hidden_talent":"Will never stop believing in a better tomorrow.",
        "Can't resist":"Fun. Parties, the beach. If they can be the center of it, even better.",
        "Hard_to_understand_for_them":"Responsibility is a virtue, not a restrictor.",
        "Best_gift_for_them":"A party filled with people who adore them.",
        "Professionals":"Actor, Fashion designer, human resources specialist"},
"ESFJ":{"general":"They are obsessed with their appearances and being liked. They follow gender roles more than others. They always want to talk about their new gadget and winning the game. They are manipulated by the opinions of the community. They don’t have a big dream rather than been famous.",
        "Features":"Warmhearted, conscientious, and cooperative. Want harmony in their environment, work with determination to establish it. Loyal, follow through even in small matters.",
        "Special_Feature":"Understanding",
        "Best_At":"Seeing everyone get along and happy.",
        "hidden_talent":"Ability to nurture people.",
        "Can't resist":"The chance to be liked.",
        "Hard_to_understand_for_them":"Gossip can be destructive.",
        "Best_gift_for_them":"Their favorite dish done to perfection.",
        "Professionals":"Social work, Bookkeepers, counsellors"},
"ENFP":{"general":"They have excellent people dealing skills. They also have genuine care for people and society which make them a great leader. They are very flexible and like to keep their options open. They dislike routine work and easily distract for their work but they focus on the future.",
        "Features":"Warmly enthusiastic and imaginative. See life as full of possibilities. Spontaneous and flexible, often rely on their ability to improvise and their verbal fluency.",
        "Special_Feature":"Optimistic",
        "Best_At":"Connecting to a person entirely, learning about them, and even helping them.",
        "hidden_talent":"Ability to cultivate potential.",
        "Can't resist":"There is nothing like a good joke or prank. Humor",
        "Hard_to_understand_for_them":"You need to be more focused, and not skip from topic to topic.",
        "Best_gift_for_them":"A day in bed at a beachside vacation home with the love of their life.",
        "Professionals":"Coaching, Artists, Leaders"},
"ENFJ":{"general":"They are extremely extraverts like to enjoy time with people. They need time to organize their thoughts. They want to control the freak situation. They are anxious when they aren't controlling their surroundings, people included. They have manipulating and bossing nature.",
        "Features":"Warm, empathetic, responsive, and responsible. Highly attuned to the emotions, needs, and motivations of others. Loyal, responsive to praise and criticism. Sociable.",
        "Special_Feature":"Helpfulness",
        "Best_At":"Reaching out to many people and being the hope for them.",
        "hidden_talent":"Ability to preserve the present.",
        "Can't resist":"Knowledge about other people.",
        "Hard_to_understand_for_them":"Despite your virtuous behavior, you aren’t always going to be good all the time.",
        "Best_gift_for_them":"A large marketing exposure for their business.",
        "Professionals":"Psychologists, Teachers, Sale representative"},
"ENTP":{"general":"They are usually interacting with a wide range of peoples. They are good in debates and engaging people in the debates. They are focus on the future rather than immediate details. They have a Thinking of “wait and see” and plan according to this. They will insult, mock, argue with people. ",
        "Features":"Quick, ingenious, stimulating, alert, and outspoken. Bored by routine, will seldom do the same thing the same way, apt to turn to one new interest after another.",
        "Special_Feature":"Flexibility",
        "Best_At":"Having a very fruitful debate and better if they find the answer.",
        "hidden_talent":"Ability to see nuances in the conversation.",
        "Can't resist":"A battle of thoughts.",
        "Hard_to_understand_for_them":"Arguing with everything that everybody else says won’t make progress.",
        "Best_gift_for_them":"A multi-national trip to places they always wanted to visit.",
        "Professionals":"Lawmakers, Inventor, Journalists"},
"ENTJ":{"general":"They have strong verbal and communication skills to contact the peoples. They lose themselves in ambition, scheming and bribing and use their charisma as a weapon to achieve to a higher place. They consider facts and objective data while decision making. They are good planners.",
        "Features":"Frank, decisive, assumes leadership readily. Quickly see illogical and inefficient procedures and policies. Forceful in presenting their ideas.",
        "Special_Feature":"Determined",
        "Best_At":"Everyone appreciating their thoughts and advices.",
        "hidden_talent":"Ability to see nuances in the conversation.",
        "Can't resist":"Sweet success.",
        "Hard_to_understand_for_them":"You won’t always be the leader.",
        "Best_gift_for_them":"A day with their idol or mentor.",
        "Professionals":"Lawmakers, CEOs, Businessmen"}
}
]